# GetSpecTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..GetSpecTypeId Method
ScheduleField Class See Also
---
The spec describing values of this field, if applicable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ForgeTypeId GetSpecTypeId()
```

Visual Basic
---
```text
Public Function GetSpecTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetSpecTypeId()
```

# ### Return Value
Identifier of the spec, or empty if the field does not represent a number with units.
# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace